src/stubs/query.customer.balances.stub.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ars="http://www.huawei.com/bme/cbsinterface/arservices" xmlns:cbs="http://www.huawei.com/bme/cbsinterface/cbscommon" xmlns:arc="http://cbs.huawei.com/ar/wsservice/arcommon">
    <soapenv:Header/>
    <soapenv:Body>
        <ars:QuerySumBalanceAndCreditRequestMsg>
            <RequestHeader>
                <cbs:Version>1</cbs:Version>
                <cbs:BusinessCode>1</cbs:BusinessCode>
                <cbs:MessageSeq>{{trans_id}}</cbs:MessageSeq>
                <cbs:OwnershipInfo>
                    <cbs:BEID>101</cbs:BEID>
                </cbs:OwnershipInfo>
                <cbs:AccessSecurity>
                    <cbs:LoginSystemCode>{{username}}</cbs:LoginSystemCode>
                    <cbs:Password>{{password}}</cbs:Password>
                </cbs:AccessSecurity>
                <cbs:MsgLanguageCode>2003</cbs:MsgLanguageCode>
            </RequestHeader>
            <QuerySumBalanceAndCreditRequest>
                <ars:QueryObj>
                    <!--You have a CHOICE of the next 2 items at this level-->
                    <ars:SubAccessCode>
                        <!--You have a CHOICE of the next 2 items at this level-->
                        <arc:PrimaryIdentity>{{msisdn}}</arc:PrimaryIdentity>
                    </ars:SubAccessCode>
                </ars:QueryObj>
            </QuerySumBalanceAndCreditRequest>
        </ars:QuerySumBalanceAndCreditRequestMsg>
    </soapenv:Body>
</soapenv:Envelope>